#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + name                                      = "DHT-KEYCLOAK"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://auth.htk.healthcarebc.ca/realms/dht/broker/moh_applications/endpoint",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.DHT-KEYCLOAK.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-LICENCE-STATUS will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-LICENCE-STATUS" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "LICENCE-STATUS"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Client Role Mapper for LICENCE-STATUS"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DHT-DEV.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "Digital Health Toolkit Dev Environment. The client is part of LRA integration." -> "Digital Health Toolkit Dev Environment. The client is part of LRA integration. Client used to connect to LRA Authorization Server.  Referenced as DHT-Keycloak in Prod."
        id                                         = "1cacf7fe-e9c7-456b-9ebf-7ad74c7494e5"
        name                                       = "DHT-DEV"
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.LRA-DEV.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "Longitudinal Record Access. Dev Environment. LRA is a FHIR Server to access Longitudinal Health Records." -> "Longitudinal Record Access. Dev Environment. LRA is a FHIR Server to access Longitudinal Health Records. Client used to connect to LRA Authorization Server. Referenced as DHT-Keycloak in Prod."
        id                                         = "45767fdd-3ce0-470c-9895-5749e943b852"
        name                                       = "LRA-DEV"
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.LRA-SANDBOX.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "Longitudinal Record Access. Sandbox Environment. LRA is a FHIR Server to access Longitudinal Health Records." -> "Longitudinal Record Access. Sandbox Environment. LRA is a FHIR Server to access Longitudinal Health Records. Client used to connect to LRA Authorization Server. Referenced as DHT-Keycloak in Prod."
        id                                         = "3aaf8a99-4c07-4668-9f28-9e2ed36aa029"
        name                                       = "LRA-SANDBOX"
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.LRA-TEST.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "Longitudinal Record Access. Test Environment. LRA is a FHIR Server to access Longitudinal Health Records." -> "Longitudinal Record Access. Test Environment. LRA is a FHIR Server to access Longitudinal Health Records. Client used to connect to LRA Authorization Server. Referenced as DHT-Keycloak in Prod."
        id                                         = "63f7cb96-b409-4384-a707-92845e5e0eb5"
        name                                       = "LRA-TEST"
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.DHT-KEYCLOAK.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MD"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "2a654d48-f695-4d2c-8eb0-d47cd50b8ec9"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.DHT-KEYCLOAK.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MOA"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "6bc1847c-432e-48a8-bf39-efafd1aa2fe8"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.DHT-KEYCLOAK.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/PRACTITIONER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "27a96e6f-ab21-4bac-873e-d80c851aea01"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.DHT-KEYCLOAK.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/RNP"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "23da7b3a-b666-4cb8-b04c-00d2d226ce2d"
    }

Plan: 7 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*